# Brewfile - @humbertowoody
# This file holds all the packages that should be installed by using
# the homebrew package manager.

# Normal brew formulaes

# helm - package manager for k8s
brew "helm"

# git lfs - for storing large files
# in use by [humbertowoody/papes](https://github.com/humbertowoody/papes)
brew "git-lfs"

# YouTube Download videos from the terminal
brew "youtube-dl"

# Elixir
brew "elixir"

# GCC
brew "gcc"

# figlet
brew "figlet"

# glow - tool to render markdown on cli
brew "glow"

# cowsay
brew "cowsay"

# httpie - curl-like tool with better features and functionality
brew "httpie"

# tmux
brew "tmux"

# weechat
brew "weechat"

# wakeonlan
brew "wakeonlan"

# fortune
brew "fortune"

# k9s - kubernetes manager
brew "k9s"

# lolcat
brew "lolcat"

# terraform
brew "terraform"

# kubectx
brew "kubectx"

# node
brew "node"

# Cask formulaes
tap "homebrew/cask"

# Transmission
cask "transmission"

# alacritty
cask "alacritty"

# dbeaver
cask "dbeaver-community"

